---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectShapeType
source: html/30d41c81-de27-d497-853c-01bd64524d40.htm
---
# DirectShapeType Methods

Adds the externally tagged geometry object to the DirectShapeType.